-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- Máy chủ: 127.0.0.1
-- Thời gian đã tạo: Th3 10, 2026 lúc 08:11 PM
-- Phiên bản máy phục vụ: 10.4.32-MariaDB
-- Phiên bản PHP: 8.2.12

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Cơ sở dữ liệu: `football_system`
--

-- --------------------------------------------------------

--
-- Cấu trúc bảng cho bảng `bookings`
--

CREATE TABLE `bookings` (
  `booking_id` int(11) NOT NULL,
  `field_field_type_id` int(11) NOT NULL,
  `booking_date` date NOT NULL COMMENT 'Ngày sử dụng sân',
  `start_time` time NOT NULL COMMENT 'Giờ bắt đầu chơi',
  `end_time` time NOT NULL,
  `user_id` int(11) NOT NULL COMMENT 'Người tạo booking\r\nVí dụ Nhân viên lễ tân',
  `duration_minutes` int(11) DEFAULT NULL,
  `price_per_hour` decimal(10,2) NOT NULL COMMENT 'snapshot giá tại thời điểm đặt',
  `total_price` decimal(10,2) NOT NULL COMMENT 'total_price = price_per_hour × (duration_minutes / 60).\r\n\r\n[Giá sân gốc (chưa dịch vụ, chưa giảm]',
  `final_price` decimal(10,2) DEFAULT NULL COMMENT 'tổng tiền cuối cùng. total_price + booking_services.\r\n(Giá cuối khách phải trả)',
  `booking_status` enum('pending','confirmed','completed','cancelled') DEFAULT 'pending',
  `created_at` datetime DEFAULT current_timestamp() COMMENT 'ngày đặt ngay tại thời điểm submit form. Dùng để xắp sếp'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Đang đổ dữ liệu cho bảng `bookings`
--

INSERT INTO `bookings` (`booking_id`, `field_field_type_id`, `booking_date`, `start_time`, `end_time`, `user_id`, `duration_minutes`, `price_per_hour`, `total_price`, `final_price`, `booking_status`, `created_at`) VALUES
(7, 1, '2026-01-20', '18:00:00', '19:30:00', 20, 90, 300000.00, 450000.00, 450000.00, 'completed', '2026-01-17 21:23:41'),
(8, 2, '2026-01-21', '20:00:00', '21:00:00', 20, 60, 500000.00, 500000.00, 500000.00, 'completed', '2026-01-17 21:23:51'),
(9, 1, '2026-02-03', '06:00:00', '16:00:00', 20, 600, 180000.00, 1800000.00, 1800000.00, 'completed', '2026-02-01 01:41:10'),
(10, 1, '2026-02-01', '08:00:00', '10:00:00', 20, 120, 180000.00, 360000.00, 360000.00, 'completed', '2026-02-01 01:53:44'),
(11, 1, '2026-02-04', '06:00:00', '16:00:00', 22, 600, 180000.00, 1800000.00, 1800000.00, 'completed', '2026-02-01 02:18:09'),
(12, 1, '2026-02-06', '06:00:00', '22:00:00', 22, 960, 320000.00, 5120000.00, 5220000.00, 'completed', '2026-02-01 02:29:28'),
(13, 1, '2026-02-01', '16:00:00', '22:00:00', 22, 360, 250000.00, 1500000.00, 1500000.00, 'completed', '2026-02-01 02:57:43'),
(14, 1, '2026-02-02', '06:00:00', '16:00:00', 22, 600, 180000.00, 1800000.00, 1800000.00, 'completed', '2026-02-01 03:09:26'),
(15, 1, '2026-02-01', '06:00:00', '16:00:00', 22, 600, 180000.00, 1800000.00, 1800000.00, 'completed', '2026-02-01 03:11:51'),
(16, 1, '2026-02-03', '06:00:00', '16:00:00', 22, 600, 180000.00, 1800000.00, 1800000.00, 'completed', '2026-02-01 03:14:37'),
(17, 1, '2026-02-02', '16:00:00', '22:00:00', 22, 360, 250000.00, 1500000.00, 1500000.00, 'completed', '2026-02-01 03:21:29'),
(18, 1, '2026-02-03', '16:00:00', '22:00:00', 22, 360, 250000.00, 1500000.00, 1500000.00, 'completed', '2026-02-01 03:23:38'),
(19, 1, '2026-02-06', '18:00:00', '21:00:00', 22, 180, 500000.00, 1500000.00, 1500000.00, 'completed', '2026-02-01 03:27:35'),
(20, 1, '2026-02-04', '06:00:00', '16:00:00', 22, 600, 180000.00, 1800000.00, 1800000.00, 'completed', '2026-02-01 03:28:55'),
(21, 1, '2026-02-04', '16:00:00', '22:00:00', 22, 360, 270000.00, 1620000.00, 1620000.00, 'completed', '2026-02-01 03:29:34'),
(22, 1, '2026-02-01', '16:00:00', '22:00:00', 22, 360, 250000.00, 1500000.00, 1500000.00, 'completed', '2026-02-01 03:30:50'),
(23, 1, '2026-02-01', '06:00:00', '16:00:00', 23, 600, 180000.00, 1800000.00, 1800000.00, 'completed', '2026-02-01 03:46:01'),
(24, 1, '2026-02-05', '16:00:00', '22:00:00', 23, 360, 300000.00, 1800000.00, 1800000.00, 'completed', '2026-02-01 03:53:37'),
(25, 1, '2026-02-02', '06:00:00', '16:00:00', 20, 600, 180000.00, 1800000.00, 2400000.00, 'completed', '2026-02-01 18:43:16'),
(26, 1, '2026-02-05', '06:00:00', '16:00:00', 20, 600, 200000.00, 2000000.00, 2500000.00, 'completed', '2026-02-03 01:46:04'),
(27, 1, '2026-02-01', '06:00:00', '16:00:00', 23, 600, 180000.00, 1800000.00, 1800000.00, 'cancelled', '2026-02-01 03:46:01'),
(28, 1, '2026-02-06', '06:00:00', '16:00:00', 17, 600, 200000.00, 2000000.00, 2000000.00, 'completed', '2026-02-03 21:11:30'),
(29, 1, '2026-02-04', '06:00:00', '15:03:00', 20, 543, 180000.00, 1629000.00, 1629000.00, 'completed', '2026-02-03 21:29:28'),
(30, 1, '2026-02-06', '16:00:00', '22:00:00', 17, 360, 300000.00, 1800000.00, 1800000.00, 'completed', '2026-02-03 21:34:55'),
(31, 1, '2026-02-08', '06:00:00', '22:00:00', 17, 960, 350000.00, 5600000.00, 5600000.00, 'completed', '2026-02-03 21:36:32'),
(32, 1, '2026-02-04', '16:00:00', '22:00:00', 17, 360, 250000.00, 1500000.00, 1500000.00, 'completed', '2026-02-03 21:37:02'),
(33, 1, '2026-02-07', '18:00:00', '21:00:00', 24, 180, 500000.00, 1500000.00, 1500000.00, 'cancelled', '2026-02-04 16:03:40'),
(34, 6, '2026-02-09', '06:00:00', '16:00:00', 20, 600, 180000.00, 1800000.00, 1800000.00, 'completed', '2026-02-07 20:52:56'),
(35, 13, '2026-02-11', '06:00:00', '16:00:00', 20, 600, 300000.00, 3000000.00, 3000000.00, 'completed', '2026-02-07 20:53:55'),
(36, 11, '2026-02-10', '06:00:00', '16:00:00', 20, 600, 180000.00, 1800000.00, 1800000.00, 'completed', '2026-02-07 20:54:24'),
(37, 11, '2026-02-12', '06:00:00', '16:00:00', 20, 600, 180000.00, 1800000.00, 1800000.00, 'completed', '2026-02-07 20:55:06'),
(38, 4, '2026-02-26', '16:00:00', '22:00:00', 26, 360, 270000.00, 1620000.00, 1620000.00, 'pending', '2026-02-24 21:32:52'),
(39, 10, '2026-03-04', '16:00:00', '22:00:00', 20, 360, 170000.00, 1020000.00, 1020000.00, 'pending', '2026-02-26 21:42:52'),
(40, 2, '2026-02-28', '18:00:00', '21:00:00', 20, 180, 750000.00, 2250000.00, 2250000.00, 'completed', '2026-02-26 21:52:09'),
(41, 2, '2026-03-04', '16:00:00', '22:00:00', 20, 360, 375000.00, 2250000.00, 2250000.00, 'completed', '2026-02-26 21:52:27'),
(42, 2, '2026-03-03', '16:00:00', '22:00:00', 20, 360, 375000.00, 2250000.00, 2250000.00, 'completed', '2026-02-26 21:53:02'),
(43, 2, '2026-03-02', '06:00:00', '16:00:00', 20, 600, 270000.00, 2700000.00, 2700000.00, 'completed', '2026-02-26 21:53:34'),
(44, 2, '2026-03-02', '16:00:00', '22:00:00', 20, 360, 375000.00, 2250000.00, 2250000.00, 'completed', '2026-02-26 21:54:30'),
(45, 11, '2026-02-27', '16:00:00', '22:00:00', 20, 360, 300000.00, 1800000.00, 1800000.00, 'pending', '2026-02-26 21:58:57'),
(46, 5, '2026-03-04', '16:00:00', '22:00:00', 20, 360, 170000.00, 1020000.00, 1020000.00, 'pending', '2026-02-28 23:16:24'),
(47, 4, '2026-03-02', '16:00:00', '22:00:00', 20, 360, 250000.00, 1500000.00, 1500000.00, 'pending', '2026-02-28 23:19:50'),
(48, 1, '2026-03-08', '06:00:00', '22:00:00', 20, 960, 350000.00, 5600000.00, 5600000.00, 'completed', '2026-03-04 23:17:25'),
(49, 1, '2026-03-11', '16:00:00', '22:00:00', 27, 360, 250000.00, 1500000.00, 1500000.00, 'completed', '2026-03-05 13:02:07'),
(50, 1, '2026-03-14', '06:00:00', '22:00:00', 20, 960, 350000.00, 5600000.00, 5600000.00, 'pending', '2026-03-11 00:27:37');

-- --------------------------------------------------------

--
-- Cấu trúc bảng cho bảng `booking_services`
--

CREATE TABLE `booking_services` (
  `booking_service_id` int(11) NOT NULL,
  `booking_id` int(11) DEFAULT NULL,
  `branch_service_id` int(11) NOT NULL,
  `quantity` int(11) DEFAULT 1 COMMENT 'Số lượng dùng service_id\r\n',
  `total_price` decimal(10,2) DEFAULT NULL COMMENT 'Tổng tiền của dịch vụ này',
  `unit_price` decimal(10,2) DEFAULT NULL COMMENT 'Giá tại thời điểm đặt, không ảnh hưởng khi thay đổi bảng giá'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci COMMENT='các dịch vụ cụ thể mà một lượt đặt sân đã sử dụng. 1 - N';

--
-- Đang đổ dữ liệu cho bảng `booking_services`
--

INSERT INTO `booking_services` (`booking_service_id`, `booking_id`, `branch_service_id`, `quantity`, `total_price`, `unit_price`) VALUES
(1, 12, 2, 2, 100000.00, 50000.00),
(2, 25, 2, 12, 600000.00, 50000.00),
(3, 26, 2, 10, 500000.00, 50000.00);

-- --------------------------------------------------------

--
-- Cấu trúc bảng cho bảng `branches`
--

CREATE TABLE `branches` (
  `branch_id` int(11) NOT NULL,
  `branch_name` varchar(100) NOT NULL,
  `address` varchar(255) DEFAULT NULL,
  `phone` varchar(20) DEFAULT NULL,
  `open_time` time DEFAULT NULL,
  `close_time` time DEFAULT NULL,
  `status` tinyint(4) DEFAULT 1,
  `created_at` datetime DEFAULT current_timestamp(),
  `thumbnail` varchar(255) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci COMMENT='Chi nhánh mỗi chi nhánh có thể có nhiều sân, mỗi sân 1 chi nhánh';

--
-- Đang đổ dữ liệu cho bảng `branches`
--

INSERT INTO `branches` (`branch_id`, `branch_name`, `address`, `phone`, `open_time`, `close_time`, `status`, `created_at`, `thumbnail`) VALUES
(1, 'Sân bóng Cái Răng Central', 'Đường Võ Nguyên Giáp, P. Phú Thứ, Q. Cái Răng, TP. Cần Thơ', '02923 888 111', '06:00:00', '22:00:00', 1, '2026-01-18 17:40:28', NULL),
(2, 'Sân bóng Phú Thứ', 'KDC Phú An, P. Phú Thứ, Q. Cái Răng, TP. Cần Thơ', '02923 888 222', '05:30:00', '23:00:00', 1, '2026-01-18 17:40:28', NULL),
(3, 'Sân bóng Hưng Phú', 'Đường Nguyễn Văn Linh, P. Hưng Phú, Q. Cái Răng, TP. Cần Thơ', '02923 888 333', '06:00:00', '22:30:00', 1, '2026-01-18 17:40:28', NULL),
(4, 'Sân bóng Trần Hoàng Na', 'Đường Trần Hoàng Na, P. Hưng Thạnh, Q. Cái Răng, TP. Cần Thơ', '02923 888 444', '06:00:00', '21:30:00', 1, '2026-01-18 17:40:28', NULL);

-- --------------------------------------------------------

--
-- Cấu trúc bảng cho bảng `branch_notifications`
--

CREATE TABLE `branch_notifications` (
  `branch_notification_id` int(11) NOT NULL,
  `branch_id` int(11) NOT NULL,
  `booking_id` int(11) DEFAULT NULL,
  `content` text NOT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp(),
  `is_read` tinyint(1) NOT NULL DEFAULT 0
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci COMMENT='Thong bao cho chu chi nhanh';

--
-- Đang đổ dữ liệu cho bảng `branch_notifications`
--

INSERT INTO `branch_notifications` (`branch_notification_id`, `branch_id`, `booking_id`, `content`, `created_at`, `is_read`) VALUES
(6, 2, 34, 'Co khach dat Sân 2A - Sân 11 người ngay 2026-02-09 luc 06:00', '2026-02-07 13:52:56', 0),
(7, 1, 35, 'Co khach dat Sân 3C - Sân 7 người ngay 2026-02-11 luc 06:00', '2026-02-07 13:53:55', 0),
(8, 1, 36, 'Co khach dat VIP2 - Sân 11 người ngay 2026-02-10 luc 06:00', '2026-02-07 13:54:24', 0),
(9, 1, 37, 'Co khach dat VIP2 - Sân 11 người ngay 2026-02-12 luc 06:00', '2026-02-07 13:55:06', 0),
(10, 1, 38, 'Co khach dat Sân 1B - Sân 5 người ngay 2026-02-26 luc 16:00', '2026-02-24 14:32:52', 0),
(11, 1, 39, 'Co khach dat VIP2 - Sân 7 người ngay 2026-03-04 luc 16:00', '2026-02-26 14:42:52', 0),
(17, 1, 45, 'Co khach dat VIP2 - Sân 11 người ngay 2026-02-27 luc 16:00', '2026-02-26 14:58:57', 0),
(18, 1, 46, 'Co khach dat Sân 1B - Sân 7 người ngay 2026-03-04 luc 16:00', '2026-02-28 16:16:24', 0),
(19, 1, 47, 'Co khach dat Sân 1B - Sân 5 người ngay 2026-03-02 luc 16:00', '2026-02-28 16:19:50', 0),
(20, 3, 48, 'Co khach dat Sân 1A - Sân 5 người ngay 2026-03-08 luc 06:00', '2026-03-04 16:17:25', 0),
(21, 3, 49, 'Co khach dat Sân 1A - Sân 5 người ngay 2026-03-11 luc 16:00', '2026-03-05 06:02:07', 0),
(22, 3, 50, 'Co khach dat Sân 1A - Sân 5 người ngay 2026-03-14 luc 06:00', '2026-03-10 17:27:37', 0);

-- --------------------------------------------------------

--
-- Cấu trúc bảng cho bảng `branch_services`
--

CREATE TABLE `branch_services` (
  `branch_service_id` int(11) NOT NULL,
  `branch_id` int(11) NOT NULL,
  `service_id` int(11) NOT NULL,
  `price` decimal(10,2) DEFAULT NULL,
  `status` enum('available','disabled') NOT NULL DEFAULT 'available',
  `created_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci COMMENT='Bảng trung gian giữ branches và services. Một service có thể co nhiều branh khác cũng có.';

--
-- Đang đổ dữ liệu cho bảng `branch_services`
--

INSERT INTO `branch_services` (`branch_service_id`, `branch_id`, `service_id`, `price`, `status`, `created_at`) VALUES
(1, 1, 2, 10000.00, 'available', '2026-01-26 15:18:10'),
(2, 3, 3, 50000.00, 'available', '2026-01-26 15:18:10'),
(3, 1, 4, 40000.00, 'available', '2026-01-26 15:18:10'),
(4, 1, 2, 25000.00, 'available', '2026-01-26 15:18:10');

-- --------------------------------------------------------

--
-- Cấu trúc bảng cho bảng `favorites`
--

CREATE TABLE `favorites` (
  `favority_id` int(11) NOT NULL,
  `user_id` int(11) NOT NULL,
  `field_id` int(11) NOT NULL,
  `add_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

-- --------------------------------------------------------

--
-- Cấu trúc bảng cho bảng `fields`
--

CREATE TABLE `fields` (
  `field_id` int(11) NOT NULL,
  `branch_id` int(11) DEFAULT NULL COMMENT 'sân này thuộc chinh nhánh nào',
  `field_name` varchar(50) DEFAULT NULL COMMENT 'Sân 1A, 2A, 3B, VIP1, VIP2 ...',
  `thumbnail` varchar(255) DEFAULT NULL,
  `status` enum('available','maintenance') DEFAULT NULL,
  `description` text DEFAULT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci COMMENT='Sân bóng';

--
-- Đang đổ dữ liệu cho bảng `fields`
--

INSERT INTO `fields` (`field_id`, `branch_id`, `field_name`, `thumbnail`, `status`, `description`, `created_at`) VALUES
(1, 3, 'Sân 1A', 'pexels-140938577-10347868.jpg', 'available', 'Sân 5 người cỏ nhân tạo', '2026-01-19 04:57:41'),
(2, 1, 'Sân 1B', 'pexels-anastasia-shuraeva-9519543.jpg', 'available', 'Sân 5 người cỏ nhân tạo', '2026-01-19 04:57:41'),
(3, 2, 'Sân 2A', 'pexels-ben-khatry-430197437-20254635.jpg', 'available', 'Sân 7 người cỏ mới', '2026-01-19 04:57:41'),
(4, 2, 'Sân 2B', 'pexels-pixabay-47730.jpg', 'maintenance', 'Sân 7 người đang bảo trì', '2026-01-19 04:57:41'),
(5, 4, 'VIP1', 'pexels-pixabay-47730.jpg', 'available', 'Sân 11 người VIP, cỏ cao cấp', '2026-01-19 04:57:41'),
(6, 1, 'VIP2', 'pexels-pixabay-47730.jpg', 'available', 'Sân 11 người VIP, có đèn ban đêm', '2026-01-19 04:57:41'),
(7, 1, 'Sân 3C', 'pexels-pixabay-47730.jpg', 'available', '', '2026-02-05 19:13:09'),
(8, 1, 'Sân 3D', 'pexels-pixabay-47730.jpg', 'available', '', '2026-02-05 19:19:25');

-- --------------------------------------------------------

--
-- Cấu trúc bảng cho bảng `field_field_types`
--

CREATE TABLE `field_field_types` (
  `field_field_type_id` int(11) NOT NULL,
  `field_id` int(11) NOT NULL COMMENT 'bảng fields',
  `field_type_id` int(11) NOT NULL COMMENT 'bảng field_types',
  `price_per_hour` decimal(10,2) NOT NULL COMMENT 'giá gốc, giá thường',
  `max_players` varchar(255) DEFAULT NULL,
  `status` enum('available','maintenance','locked') DEFAULT 'available',
  `creared_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci COMMENT='Bảng trung gian giữa fields và field_types. Một field có nhiều field_types và một field_type lại có nhiều field cũng có filed_type đó. N-N';

--
-- Đang đổ dữ liệu cho bảng `field_field_types`
--

INSERT INTO `field_field_types` (`field_field_type_id`, `field_id`, `field_type_id`, `price_per_hour`, `max_players`, `status`, `creared_at`) VALUES
(1, 1, 1, 300000.00, '5', 'available', '2026-01-24 13:23:18'),
(2, 1, 2, 450000.00, '7', 'available', '2026-01-24 13:23:18'),
(3, 1, 3, 700000.00, '11', 'available', '2026-01-24 13:23:18'),
(4, 2, 1, 300000.00, '5', 'available', '2026-01-24 13:23:18'),
(5, 2, 2, 200000.00, '2', 'available', '2026-01-24 13:23:18'),
(6, 3, 3, 300000.00, '0', 'available', '2026-01-24 13:23:18'),
(7, 4, 1, 300000.00, '5', 'available', '2026-01-24 13:23:18'),
(8, 4, 2, 300000.00, '5', 'available', '2026-01-24 13:23:18'),
(9, 5, 2, 300000.00, '5', 'available', '2026-01-24 13:23:18'),
(10, 6, 2, 200000.00, '0', 'available', '2026-01-24 13:23:18'),
(11, 6, 3, 300000.00, '0', 'available', '2026-01-24 13:23:18'),
(12, 7, 1, 300000.00, '5', 'available', '2026-02-05 19:14:12'),
(13, 7, 2, 500000.00, '7', 'available', '2026-02-05 19:14:27'),
(14, 7, 3, 800000.00, '11', 'available', '2026-02-05 19:14:40');

-- --------------------------------------------------------

--
-- Cấu trúc bảng cho bảng `field_pricing_rules`
--

CREATE TABLE `field_pricing_rules` (
  `pricing_rule_id` int(11) NOT NULL,
  `field_field_type_id` int(11) NOT NULL,
  `day_of_week` tinyint(4) NOT NULL COMMENT 'thứ mấy 2-cn',
  `start_time` time NOT NULL COMMENT 'giờ bắt đâu',
  `end_time` time NOT NULL COMMENT 'Giờ kết thúc',
  `price_per_hour` decimal(10,2) NOT NULL COMMENT 'Giá tiền trong khung giờ này (start_time - end_time)',
  `rule_type` enum('peak','off_peak','special') DEFAULT 'peak' COMMENT 'Giờ vàng, ngoài giờ cao điểm, đặc biệt',
  `status` enum('active','inactive') DEFAULT 'active',
  `created_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Đang đổ dữ liệu cho bảng `field_pricing_rules`
--

INSERT INTO `field_pricing_rules` (`pricing_rule_id`, `field_field_type_id`, `day_of_week`, `start_time`, `end_time`, `price_per_hour`, `rule_type`, `status`, `created_at`) VALUES
(1, 1, 2, '06:00:00', '16:00:00', 180000.00, 'off_peak', 'active', '2026-01-27 14:58:38'),
(2, 1, 3, '06:00:00', '16:00:00', 180000.00, 'off_peak', 'active', '2026-01-27 14:58:38'),
(3, 1, 4, '06:00:00', '16:00:00', 180000.00, 'off_peak', 'active', '2026-01-27 14:58:38'),
(4, 1, 5, '06:00:00', '16:00:00', 180000.00, 'off_peak', 'active', '2026-01-27 14:58:38'),
(5, 1, 6, '06:00:00', '16:00:00', 200000.00, 'off_peak', 'active', '2026-01-27 14:58:38'),
(6, 1, 7, '18:00:00', '21:00:00', 500000.00, 'peak', 'active', '2026-01-29 15:09:16'),
(16, 1, 2, '16:00:00', '22:00:00', 250000.00, 'peak', 'active', '2026-01-27 14:59:04'),
(17, 1, 3, '16:00:00', '22:00:00', 250000.00, 'peak', 'active', '2026-01-27 14:59:04'),
(18, 1, 4, '16:00:00', '22:00:00', 250000.00, 'peak', 'active', '2026-01-27 14:59:04'),
(19, 1, 5, '16:00:00', '22:00:00', 270000.00, 'peak', 'active', '2026-01-27 14:59:04'),
(20, 1, 6, '16:00:00', '22:00:00', 300000.00, 'peak', 'active', '2026-01-27 14:59:04'),
(21, 1, 7, '06:00:00', '22:00:00', 320000.00, 'peak', 'active', '2026-01-27 14:59:13'),
(22, 1, 8, '06:00:00', '22:00:00', 350000.00, 'special', 'active', '2026-01-27 14:59:23'),
(23, 2, 2, '06:00:00', '16:00:00', 270000.00, 'off_peak', 'active', '2026-02-05 12:20:00'),
(24, 2, 3, '06:00:00', '16:00:00', 270000.00, 'off_peak', 'active', '2026-02-05 12:20:00'),
(25, 2, 4, '06:00:00', '16:00:00', 270000.00, 'off_peak', 'active', '2026-02-05 12:20:00'),
(26, 2, 5, '06:00:00', '16:00:00', 270000.00, 'off_peak', 'active', '2026-02-05 12:20:00'),
(27, 2, 6, '06:00:00', '16:00:00', 300000.00, 'off_peak', 'active', '2026-02-05 12:20:00'),
(28, 2, 2, '16:00:00', '22:00:00', 375000.00, 'peak', 'active', '2026-02-05 12:20:00'),
(29, 2, 3, '16:00:00', '22:00:00', 375000.00, 'peak', 'active', '2026-02-05 12:20:00'),
(30, 2, 4, '16:00:00', '22:00:00', 375000.00, 'peak', 'active', '2026-02-05 12:20:00'),
(31, 2, 5, '16:00:00', '22:00:00', 405000.00, 'peak', 'active', '2026-02-05 12:20:00'),
(32, 2, 6, '16:00:00', '22:00:00', 450000.00, 'peak', 'active', '2026-02-05 12:20:00'),
(33, 2, 7, '06:00:00', '22:00:00', 480000.00, 'peak', 'active', '2026-02-05 12:20:00'),
(34, 2, 7, '18:00:00', '21:00:00', 750000.00, 'peak', 'active', '2026-02-05 12:20:00'),
(35, 2, 8, '06:00:00', '22:00:00', 525000.00, 'special', 'active', '2026-02-05 12:20:00'),
(36, 3, 2, '06:00:00', '16:00:00', 420000.00, 'off_peak', 'active', '2026-02-05 12:20:00'),
(37, 3, 3, '06:00:00', '16:00:00', 420000.00, 'off_peak', 'active', '2026-02-05 12:20:00'),
(38, 3, 4, '06:00:00', '16:00:00', 420000.00, 'off_peak', 'active', '2026-02-05 12:20:00'),
(39, 3, 5, '06:00:00', '16:00:00', 420000.00, 'off_peak', 'active', '2026-02-05 12:20:00'),
(40, 3, 6, '06:00:00', '16:00:00', 470000.00, 'off_peak', 'active', '2026-02-05 12:20:00'),
(41, 3, 2, '16:00:00', '22:00:00', 580000.00, 'peak', 'active', '2026-02-05 12:20:00'),
(42, 3, 3, '16:00:00', '22:00:00', 580000.00, 'peak', 'active', '2026-02-05 12:20:00'),
(43, 3, 4, '16:00:00', '22:00:00', 580000.00, 'peak', 'active', '2026-02-05 12:20:00'),
(44, 3, 5, '16:00:00', '22:00:00', 630000.00, 'peak', 'active', '2026-02-05 12:20:00'),
(45, 3, 6, '16:00:00', '22:00:00', 700000.00, 'peak', 'active', '2026-02-05 12:20:00'),
(46, 3, 7, '06:00:00', '22:00:00', 750000.00, 'peak', 'active', '2026-02-05 12:20:00'),
(47, 3, 7, '18:00:00', '21:00:00', 1170000.00, 'peak', 'active', '2026-02-05 12:20:00'),
(48, 3, 8, '06:00:00', '22:00:00', 820000.00, 'special', 'active', '2026-02-05 12:20:00'),
(49, 4, 2, '06:00:00', '16:00:00', 180000.00, 'off_peak', 'active', '2026-02-05 12:20:00'),
(50, 4, 3, '06:00:00', '16:00:00', 180000.00, 'off_peak', 'active', '2026-02-05 12:20:00'),
(51, 4, 4, '06:00:00', '16:00:00', 180000.00, 'off_peak', 'active', '2026-02-05 12:20:00'),
(52, 4, 5, '06:00:00', '16:00:00', 180000.00, 'off_peak', 'active', '2026-02-05 12:20:00'),
(53, 4, 6, '06:00:00', '16:00:00', 200000.00, 'off_peak', 'active', '2026-02-05 12:20:00'),
(54, 4, 2, '16:00:00', '22:00:00', 250000.00, 'peak', 'active', '2026-02-05 12:20:00'),
(55, 4, 3, '16:00:00', '22:00:00', 250000.00, 'peak', 'active', '2026-02-05 12:20:00'),
(56, 4, 4, '16:00:00', '22:00:00', 250000.00, 'peak', 'active', '2026-02-05 12:20:00'),
(57, 4, 5, '16:00:00', '22:00:00', 270000.00, 'peak', 'active', '2026-02-05 12:20:00'),
(58, 4, 6, '16:00:00', '22:00:00', 300000.00, 'peak', 'active', '2026-02-05 12:20:00'),
(59, 4, 7, '06:00:00', '22:00:00', 320000.00, 'peak', 'active', '2026-02-05 12:20:00'),
(60, 4, 7, '18:00:00', '21:00:00', 500000.00, 'peak', 'active', '2026-02-05 12:20:00'),
(61, 4, 8, '06:00:00', '22:00:00', 350000.00, 'special', 'active', '2026-02-05 12:20:00'),
(62, 5, 2, '06:00:00', '16:00:00', 120000.00, 'off_peak', 'active', '2026-02-05 12:20:00'),
(63, 5, 3, '06:00:00', '16:00:00', 120000.00, 'off_peak', 'active', '2026-02-05 12:20:00'),
(64, 5, 4, '06:00:00', '16:00:00', 120000.00, 'off_peak', 'active', '2026-02-05 12:20:00'),
(65, 5, 5, '06:00:00', '16:00:00', 120000.00, 'off_peak', 'active', '2026-02-05 12:20:00'),
(66, 5, 6, '06:00:00', '16:00:00', 130000.00, 'off_peak', 'active', '2026-02-05 12:20:00'),
(67, 5, 2, '16:00:00', '22:00:00', 170000.00, 'peak', 'active', '2026-02-05 12:20:00'),
(68, 5, 3, '16:00:00', '22:00:00', 170000.00, 'peak', 'active', '2026-02-05 12:20:00'),
(69, 5, 4, '16:00:00', '22:00:00', 170000.00, 'peak', 'active', '2026-02-05 12:20:00'),
(70, 5, 5, '16:00:00', '22:00:00', 180000.00, 'peak', 'active', '2026-02-05 12:20:00'),
(71, 5, 6, '16:00:00', '22:00:00', 200000.00, 'peak', 'active', '2026-02-05 12:20:00'),
(72, 5, 7, '06:00:00', '22:00:00', 210000.00, 'peak', 'active', '2026-02-05 12:20:00'),
(73, 5, 7, '18:00:00', '21:00:00', 330000.00, 'peak', 'active', '2026-02-05 12:20:00'),
(74, 5, 8, '06:00:00', '22:00:00', 230000.00, 'special', 'active', '2026-02-05 12:20:00'),
(75, 6, 2, '06:00:00', '16:00:00', 180000.00, 'off_peak', 'active', '2026-02-05 12:20:00'),
(76, 6, 3, '06:00:00', '16:00:00', 180000.00, 'off_peak', 'active', '2026-02-05 12:20:00'),
(77, 6, 4, '06:00:00', '16:00:00', 180000.00, 'off_peak', 'active', '2026-02-05 12:20:00'),
(78, 6, 5, '06:00:00', '16:00:00', 180000.00, 'off_peak', 'active', '2026-02-05 12:20:00'),
(79, 6, 6, '06:00:00', '16:00:00', 201000.00, 'off_peak', 'active', '2026-02-05 12:20:00'),
(80, 6, 2, '16:00:00', '22:00:00', 249000.00, 'peak', 'active', '2026-02-05 12:20:00'),
(81, 6, 3, '16:00:00', '22:00:00', 249000.00, 'peak', 'active', '2026-02-05 12:20:00'),
(82, 6, 4, '16:00:00', '22:00:00', 249000.00, 'peak', 'active', '2026-02-05 12:20:00'),
(83, 6, 5, '16:00:00', '22:00:00', 270000.00, 'peak', 'active', '2026-02-05 12:20:00'),
(84, 6, 6, '16:00:00', '22:00:00', 300000.00, 'peak', 'active', '2026-02-05 12:20:00'),
(85, 6, 7, '06:00:00', '22:00:00', 321000.00, 'peak', 'active', '2026-02-05 12:20:00'),
(86, 6, 7, '18:00:00', '21:00:00', 501000.00, 'peak', 'active', '2026-02-05 12:20:00'),
(87, 6, 8, '06:00:00', '22:00:00', 351000.00, 'special', 'active', '2026-02-05 12:20:00'),
(88, 7, 2, '06:00:00', '16:00:00', 180000.00, 'off_peak', 'active', '2026-02-05 12:20:00'),
(89, 7, 3, '06:00:00', '16:00:00', 180000.00, 'off_peak', 'active', '2026-02-05 12:20:00'),
(90, 7, 4, '06:00:00', '16:00:00', 180000.00, 'off_peak', 'active', '2026-02-05 12:20:00'),
(91, 7, 5, '06:00:00', '16:00:00', 180000.00, 'off_peak', 'active', '2026-02-05 12:20:00'),
(92, 7, 6, '06:00:00', '16:00:00', 200000.00, 'off_peak', 'active', '2026-02-05 12:20:00'),
(93, 7, 2, '16:00:00', '22:00:00', 250000.00, 'peak', 'active', '2026-02-05 12:20:00'),
(94, 7, 3, '16:00:00', '22:00:00', 250000.00, 'peak', 'active', '2026-02-05 12:20:00'),
(95, 7, 4, '16:00:00', '22:00:00', 250000.00, 'peak', 'active', '2026-02-05 12:20:00'),
(96, 7, 5, '16:00:00', '22:00:00', 270000.00, 'peak', 'active', '2026-02-05 12:20:00'),
(97, 7, 6, '16:00:00', '22:00:00', 300000.00, 'peak', 'active', '2026-02-05 12:20:00'),
(98, 7, 7, '06:00:00', '22:00:00', 320000.00, 'peak', 'active', '2026-02-05 12:20:00'),
(99, 7, 7, '18:00:00', '21:00:00', 500000.00, 'peak', 'active', '2026-02-05 12:20:00'),
(100, 7, 8, '06:00:00', '22:00:00', 350000.00, 'special', 'active', '2026-02-05 12:20:00'),
(101, 8, 2, '06:00:00', '16:00:00', 180000.00, 'off_peak', 'active', '2026-02-05 12:20:00'),
(102, 8, 3, '06:00:00', '16:00:00', 180000.00, 'off_peak', 'active', '2026-02-05 12:20:00'),
(103, 8, 4, '06:00:00', '16:00:00', 180000.00, 'off_peak', 'active', '2026-02-05 12:20:00'),
(104, 8, 5, '06:00:00', '16:00:00', 180000.00, 'off_peak', 'active', '2026-02-05 12:20:00'),
(105, 8, 6, '06:00:00', '16:00:00', 200000.00, 'off_peak', 'active', '2026-02-05 12:20:00'),
(106, 8, 2, '16:00:00', '22:00:00', 250000.00, 'peak', 'active', '2026-02-05 12:20:00'),
(107, 8, 3, '16:00:00', '22:00:00', 250000.00, 'peak', 'active', '2026-02-05 12:20:00'),
(108, 8, 4, '16:00:00', '22:00:00', 250000.00, 'peak', 'active', '2026-02-05 12:20:00'),
(109, 8, 5, '16:00:00', '22:00:00', 270000.00, 'peak', 'active', '2026-02-05 12:20:00'),
(110, 8, 6, '16:00:00', '22:00:00', 300000.00, 'peak', 'active', '2026-02-05 12:20:00'),
(111, 8, 7, '06:00:00', '22:00:00', 320000.00, 'peak', 'active', '2026-02-05 12:20:00'),
(112, 8, 7, '18:00:00', '21:00:00', 500000.00, 'peak', 'active', '2026-02-05 12:20:00'),
(113, 8, 8, '06:00:00', '22:00:00', 350000.00, 'special', 'active', '2026-02-05 12:20:00'),
(114, 9, 2, '06:00:00', '16:00:00', 180000.00, 'off_peak', 'active', '2026-02-05 12:20:00'),
(115, 9, 3, '06:00:00', '16:00:00', 180000.00, 'off_peak', 'active', '2026-02-05 12:20:00'),
(116, 9, 4, '06:00:00', '16:00:00', 180000.00, 'off_peak', 'active', '2026-02-05 12:20:00'),
(117, 9, 5, '06:00:00', '16:00:00', 180000.00, 'off_peak', 'active', '2026-02-05 12:20:00'),
(118, 9, 6, '06:00:00', '16:00:00', 200000.00, 'off_peak', 'active', '2026-02-05 12:20:00'),
(119, 9, 2, '16:00:00', '22:00:00', 250000.00, 'peak', 'active', '2026-02-05 12:20:00'),
(120, 9, 3, '16:00:00', '22:00:00', 250000.00, 'peak', 'active', '2026-02-05 12:20:00'),
(121, 9, 4, '16:00:00', '22:00:00', 250000.00, 'peak', 'active', '2026-02-05 12:20:00'),
(122, 9, 5, '16:00:00', '22:00:00', 270000.00, 'peak', 'active', '2026-02-05 12:20:00'),
(123, 9, 6, '16:00:00', '22:00:00', 300000.00, 'peak', 'active', '2026-02-05 12:20:00'),
(124, 9, 7, '06:00:00', '22:00:00', 320000.00, 'peak', 'active', '2026-02-05 12:20:00'),
(125, 9, 7, '18:00:00', '21:00:00', 500000.00, 'peak', 'active', '2026-02-05 12:20:00'),
(126, 9, 8, '06:00:00', '22:00:00', 350000.00, 'special', 'active', '2026-02-05 12:20:00'),
(127, 10, 2, '06:00:00', '16:00:00', 120000.00, 'off_peak', 'active', '2026-02-05 12:20:00'),
(128, 10, 3, '06:00:00', '16:00:00', 120000.00, 'off_peak', 'active', '2026-02-05 12:20:00'),
(129, 10, 4, '06:00:00', '16:00:00', 120000.00, 'off_peak', 'active', '2026-02-05 12:20:00'),
(130, 10, 5, '06:00:00', '16:00:00', 120000.00, 'off_peak', 'active', '2026-02-05 12:20:00'),
(131, 10, 6, '06:00:00', '16:00:00', 130000.00, 'off_peak', 'active', '2026-02-05 12:20:00'),
(132, 10, 2, '16:00:00', '22:00:00', 170000.00, 'peak', 'active', '2026-02-05 12:20:00'),
(133, 10, 3, '16:00:00', '22:00:00', 170000.00, 'peak', 'active', '2026-02-05 12:20:00'),
(134, 10, 4, '16:00:00', '22:00:00', 170000.00, 'peak', 'active', '2026-02-05 12:20:00'),
(135, 10, 5, '16:00:00', '22:00:00', 180000.00, 'peak', 'active', '2026-02-05 12:20:00'),
(136, 10, 6, '16:00:00', '22:00:00', 200000.00, 'peak', 'active', '2026-02-05 12:20:00'),
(137, 10, 7, '06:00:00', '22:00:00', 210000.00, 'peak', 'active', '2026-02-05 12:20:00'),
(138, 10, 7, '18:00:00', '21:00:00', 330000.00, 'peak', 'active', '2026-02-05 12:20:00'),
(139, 10, 8, '06:00:00', '22:00:00', 230000.00, 'special', 'active', '2026-02-05 12:20:00'),
(140, 11, 2, '06:00:00', '16:00:00', 180000.00, 'off_peak', 'active', '2026-02-05 12:20:00'),
(141, 11, 3, '06:00:00', '16:00:00', 180000.00, 'off_peak', 'active', '2026-02-05 12:20:00'),
(142, 11, 4, '06:00:00', '16:00:00', 180000.00, 'off_peak', 'active', '2026-02-05 12:20:00'),
(143, 11, 5, '06:00:00', '16:00:00', 180000.00, 'off_peak', 'active', '2026-02-05 12:20:00'),
(144, 11, 6, '06:00:00', '16:00:00', 200000.00, 'off_peak', 'active', '2026-02-05 12:20:00'),
(145, 11, 2, '16:00:00', '22:00:00', 250000.00, 'peak', 'active', '2026-02-05 12:20:00'),
(146, 11, 3, '16:00:00', '22:00:00', 250000.00, 'peak', 'active', '2026-02-05 12:20:00'),
(147, 11, 4, '16:00:00', '22:00:00', 250000.00, 'peak', 'active', '2026-02-05 12:20:00'),
(148, 11, 5, '16:00:00', '22:00:00', 270000.00, 'peak', 'active', '2026-02-05 12:20:00'),
(149, 11, 6, '16:00:00', '22:00:00', 300000.00, 'peak', 'active', '2026-02-05 12:20:00'),
(150, 11, 7, '06:00:00', '22:00:00', 320000.00, 'peak', 'active', '2026-02-05 12:20:00'),
(151, 11, 7, '18:00:00', '21:00:00', 500000.00, 'peak', 'active', '2026-02-05 12:20:00'),
(152, 11, 8, '06:00:00', '22:00:00', 350000.00, 'special', 'active', '2026-02-05 12:20:00'),
(153, 12, 2, '06:00:00', '16:00:00', 180000.00, 'off_peak', 'active', '2026-02-05 12:20:00'),
(154, 12, 3, '06:00:00', '16:00:00', 180000.00, 'off_peak', 'active', '2026-02-05 12:20:00'),
(155, 12, 4, '06:00:00', '16:00:00', 180000.00, 'off_peak', 'active', '2026-02-05 12:20:00'),
(156, 12, 5, '06:00:00', '16:00:00', 180000.00, 'off_peak', 'active', '2026-02-05 12:20:00'),
(157, 12, 6, '06:00:00', '16:00:00', 200000.00, 'off_peak', 'active', '2026-02-05 12:20:00'),
(158, 12, 2, '16:00:00', '22:00:00', 250000.00, 'peak', 'active', '2026-02-05 12:20:00'),
(159, 12, 3, '16:00:00', '22:00:00', 250000.00, 'peak', 'active', '2026-02-05 12:20:00'),
(160, 12, 4, '16:00:00', '22:00:00', 250000.00, 'peak', 'active', '2026-02-05 12:20:00'),
(161, 12, 5, '16:00:00', '22:00:00', 270000.00, 'peak', 'active', '2026-02-05 12:20:00'),
(162, 12, 6, '16:00:00', '22:00:00', 300000.00, 'peak', 'active', '2026-02-05 12:20:00'),
(163, 12, 7, '06:00:00', '22:00:00', 320000.00, 'peak', 'active', '2026-02-05 12:20:00'),
(164, 12, 7, '18:00:00', '21:00:00', 500000.00, 'peak', 'active', '2026-02-05 12:20:00'),
(165, 12, 8, '06:00:00', '22:00:00', 350000.00, 'special', 'active', '2026-02-05 12:20:00'),
(166, 13, 2, '06:00:00', '16:00:00', 300000.00, 'off_peak', 'active', '2026-02-05 12:20:00'),
(167, 13, 3, '06:00:00', '16:00:00', 300000.00, 'off_peak', 'active', '2026-02-05 12:20:00'),
(168, 13, 4, '06:00:00', '16:00:00', 300000.00, 'off_peak', 'active', '2026-02-05 12:20:00'),
(169, 13, 5, '06:00:00', '16:00:00', 300000.00, 'off_peak', 'active', '2026-02-05 12:20:00'),
(170, 13, 6, '06:00:00', '16:00:00', 330000.00, 'off_peak', 'active', '2026-02-05 12:20:00'),
(171, 13, 2, '16:00:00', '22:00:00', 420000.00, 'peak', 'active', '2026-02-05 12:20:00'),
(172, 13, 3, '16:00:00', '22:00:00', 420000.00, 'peak', 'active', '2026-02-05 12:20:00'),
(173, 13, 4, '16:00:00', '22:00:00', 420000.00, 'peak', 'active', '2026-02-05 12:20:00'),
(174, 13, 5, '16:00:00', '22:00:00', 450000.00, 'peak', 'active', '2026-02-05 12:20:00'),
(175, 13, 6, '16:00:00', '22:00:00', 500000.00, 'peak', 'active', '2026-02-05 12:20:00'),
(176, 13, 7, '06:00:00', '22:00:00', 530000.00, 'peak', 'active', '2026-02-05 12:20:00'),
(177, 13, 7, '18:00:00', '21:00:00', 830000.00, 'peak', 'active', '2026-02-05 12:20:00'),
(178, 13, 8, '06:00:00', '22:00:00', 580000.00, 'special', 'active', '2026-02-05 12:20:00'),
(179, 14, 2, '06:00:00', '16:00:00', 480000.00, 'off_peak', 'active', '2026-02-05 12:20:00'),
(180, 14, 3, '06:00:00', '16:00:00', 480000.00, 'off_peak', 'active', '2026-02-05 12:20:00'),
(181, 14, 4, '06:00:00', '16:00:00', 480000.00, 'off_peak', 'active', '2026-02-05 12:20:00'),
(182, 14, 5, '06:00:00', '16:00:00', 480000.00, 'off_peak', 'active', '2026-02-05 12:20:00'),
(183, 14, 6, '06:00:00', '16:00:00', 530000.00, 'off_peak', 'active', '2026-02-05 12:20:00'),
(184, 14, 2, '16:00:00', '22:00:00', 670000.00, 'peak', 'active', '2026-02-05 12:20:00'),
(185, 14, 3, '16:00:00', '22:00:00', 670000.00, 'peak', 'active', '2026-02-05 12:20:00'),
(186, 14, 4, '16:00:00', '22:00:00', 670000.00, 'peak', 'active', '2026-02-05 12:20:00'),
(187, 14, 5, '16:00:00', '22:00:00', 720000.00, 'peak', 'active', '2026-02-05 12:20:00'),
(188, 14, 6, '16:00:00', '22:00:00', 800000.00, 'peak', 'active', '2026-02-05 12:20:00'),
(189, 14, 7, '06:00:00', '22:00:00', 850000.00, 'peak', 'active', '2026-02-05 12:20:00'),
(190, 14, 7, '18:00:00', '21:00:00', 1330000.00, 'peak', 'active', '2026-02-05 12:20:00'),
(191, 14, 8, '06:00:00', '22:00:00', 930000.00, 'special', 'active', '2026-02-05 12:20:00');

-- --------------------------------------------------------

--
-- Cấu trúc bảng cho bảng `field_types`
--

CREATE TABLE `field_types` (
  `field_type_id` int(11) NOT NULL,
  `type_name` varchar(20) DEFAULT NULL COMMENT 'sân 5 người, sân 7 người,sân 11 người \r\n(Hiển thị cho người dùng)',
  `players` int(11) DEFAULT NULL COMMENT 'Dùng cho logic, tính toán\r\n\r\n',
  `type_code` varchar(10) DEFAULT NULL COMMENT 'f5, f7, f11',
  `thumbnail` varchar(255) DEFAULT NULL,
  `description` text DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci COMMENT='1 chi nhánh có nhiều loại sân';

--
-- Đang đổ dữ liệu cho bảng `field_types`
--

INSERT INTO `field_types` (`field_type_id`, `type_name`, `players`, `type_code`, `thumbnail`, `description`, `created_at`) VALUES
(1, 'Sân 5 người', 5, 'f5', 'pexels-jakobjin-7086430.jpg', 'Lorem ipsum dolor sit amet consectetur adipisicing elit. Iure ducimus tempore quam minima ', '2026-01-23 16:04:10'),
(2, 'Sân 7 người', 7, 'f7', 'pexels-shan-huang-560952599-32022245.jpg', 'Lorem ipsum dolor sit amet consectetur adipisicing elit. Iure ducimus tempore quam minima ', '2026-01-23 16:04:10'),
(3, 'Sân 11 người', 11, 'f11', 'pexels-ibnulharezmi-17082186.jpg', 'Lorem ipsum dolor sit amet consectetur adipisicing elit. Iure ducimus tempore quam minima ', '2026-01-23 16:04:10');

-- --------------------------------------------------------

--
-- Cấu trúc bảng cho bảng `notifications`
--

CREATE TABLE `notifications` (
  `notification_id` int(11) NOT NULL,
  `user_id` int(11) DEFAULT NULL,
  `content` text DEFAULT NULL,
  `create_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci COMMENT='Bảng thông báo khách hàng';

--
-- Đang đổ dữ liệu cho bảng `notifications`
--

INSERT INTO `notifications` (`notification_id`, `user_id`, `content`, `create_at`) VALUES
(1, 20, 'Bạn đã đặt sân thành công (ID: 9) vào ngày 2026-02-03 lúc 06:00:00', '2026-01-31 18:41:10'),
(2, 20, 'Bạn đã đặt sân thành công (ID: 10) vào ngày 2026-02-01 lúc 08:00', '2026-01-31 18:53:44'),
(3, 22, 'Bạn đã đặt sân thành công (ID: 11) vào ngày 2026-02-04 lúc 06:00', '2026-01-31 19:18:09'),
(4, 22, 'Bạn đã đặt sân thành công (ID: 12) vào ngày 2026-02-06 lúc 06:00', '2026-01-31 19:29:28'),
(5, 22, 'Bạn đã đặt sân thành công (ID: 13) vào ngày 2026-02-01 lúc 16:00', '2026-01-31 19:57:43'),
(6, 22, 'Bạn đã đặt sân thành công (ID: 14) vào ngày 2026-02-02 lúc 06:00', '2026-01-31 20:09:26'),
(7, 22, 'Bạn đã đặt sân thành công (ID: 15) vào ngày 2026-02-01 lúc 06:00', '2026-01-31 20:11:51'),
(8, 22, 'Bạn đã đặt sân thành công (ID: 16) vào ngày 2026-02-03 lúc 06:00', '2026-01-31 20:14:37'),
(9, 22, 'Bạn đã đặt sân thành công (ID: 17) vào ngày 2026-02-02 lúc 16:00', '2026-01-31 20:21:29'),
(10, 22, 'Bạn đã đặt sân thành công (ID: 18) vào ngày 2026-02-03 lúc 16:00', '2026-01-31 20:23:38'),
(11, 22, 'Bạn đã đặt sân thành công (ID: 19) vào ngày 2026-02-06 lúc 18:00', '2026-01-31 20:27:35'),
(12, 22, 'Bạn đã đặt sân thành công (ID: 20) vào ngày 2026-02-04 lúc 06:00', '2026-01-31 20:28:55'),
(13, 22, 'Bạn đã đặt sân thành công (ID: 21) vào ngày 2026-02-04 lúc 16:00', '2026-01-31 20:29:34'),
(14, 22, 'Bạn đã đặt sân thành công (ID: 22) vào ngày 2026-02-01 lúc 16:00', '2026-01-31 20:30:50'),
(15, 23, 'Bạn đã đặt sân thành công (ID: 23) vào ngày 2026-02-01 lúc 06:00', '2026-01-31 20:46:01'),
(16, 23, 'Bạn đã đặt sân thành công (ID: 24) vào ngày 2026-02-05 lúc 16:00', '2026-01-31 20:53:37'),
(17, 20, 'Bạn đã đặt sân thành công (ID: 25) vào ngày 2026-02-02 lúc 06:00', '2026-02-01 11:43:16'),
(18, 20, 'Bạn đã đặt sân thành công (ID: 26) vào ngày 2026-02-05 lúc 06:00', '2026-02-02 18:46:04'),
(19, 17, 'Bạn đã đặt sân thành công (ID: 28) vào ngày 2026-02-06 lúc 06:00', '2026-02-03 14:11:30'),
(20, 20, 'Bạn đã đặt sân thành công (ID: 29) vào ngày 2026-02-04 lúc 06:00', '2026-02-03 14:29:28'),
(21, 17, 'Bạn đã đặt sân thành công (ID: 30) vào ngày 2026-02-06 lúc 16:00', '2026-02-03 14:34:55'),
(22, 17, 'Bạn đã đặt sân thành công (ID: 31) vào ngày 2026-02-08 lúc 06:00', '2026-02-03 14:36:32'),
(23, 17, 'Bạn đã đặt sân thành công (ID: 32) vào ngày 2026-02-04 lúc 16:00', '2026-02-03 14:37:02'),
(24, 24, 'Bạn đã đặt sân thành công (ID: 33) vào ngày 2026-02-07 lúc 18:00', '2026-02-04 09:03:40'),
(25, 20, 'Bạn đã đặt sân thành công (ID: 34) vào ngày 2026-02-09 lúc 06:00', '2026-02-07 13:52:56'),
(26, 20, 'Bạn đã đặt sân thành công (ID: 35) vào ngày 2026-02-11 lúc 06:00', '2026-02-07 13:53:55'),
(27, 20, 'Bạn đã đặt sân thành công (ID: 36) vào ngày 2026-02-10 lúc 06:00', '2026-02-07 13:54:24'),
(28, 20, 'Bạn đã đặt sân thành công (ID: 37) vào ngày 2026-02-12 lúc 06:00', '2026-02-07 13:55:06'),
(29, 26, 'Bạn đã đặt sân thành công (ID: 38) vào ngày 2026-02-26 lúc 16:00', '2026-02-24 14:32:52'),
(30, 20, 'Bạn đã đặt sân thành công (ID: 39) vào ngày 2026-03-04 lúc 16:00', '2026-02-26 14:42:52'),
(31, 20, 'Bạn đã đặt sân thành công (ID: 40) vào ngày 2026-02-28 lúc 18:00', '2026-02-26 14:52:09'),
(32, 20, 'Bạn đã đặt sân thành công (ID: 41) vào ngày 2026-03-04 lúc 16:00', '2026-02-26 14:52:27'),
(33, 20, 'Bạn đã đặt sân thành công (ID: 42) vào ngày 2026-03-03 lúc 16:00', '2026-02-26 14:53:02'),
(34, 20, 'Bạn đã đặt sân thành công (ID: 43) vào ngày 2026-03-02 lúc 06:00', '2026-02-26 14:53:34'),
(35, 20, 'Bạn đã đặt sân thành công (ID: 44) vào ngày 2026-03-02 lúc 16:00', '2026-02-26 14:54:30'),
(36, 20, 'Bạn đã đặt sân thành công (ID: 45) vào ngày 2026-02-27 lúc 16:00', '2026-02-26 14:58:57'),
(37, 20, 'Bạn đã đặt sân thành công (ID: 46) vào ngày 2026-03-04 lúc 16:00', '2026-02-28 16:16:24'),
(38, 20, 'Bạn đã đặt sân thành công (ID: 47) vào ngày 2026-03-02 lúc 16:00', '2026-02-28 16:19:50'),
(39, 20, 'Bạn đã đặt sân thành công (ID: 48) vào ngày 2026-03-08 lúc 06:00', '2026-03-04 16:17:25'),
(40, 27, 'Bạn đã đặt sân thành công (ID: 49) vào ngày 2026-03-11 lúc 16:00', '2026-03-05 06:02:07'),
(41, 20, 'Bạn đã đặt sân thành công (ID: 50) vào ngày 2026-03-14 lúc 06:00', '2026-03-10 17:27:37');

-- --------------------------------------------------------

--
-- Cấu trúc bảng cho bảng `payments`
--

CREATE TABLE `payments` (
  `payment_id` int(11) NOT NULL,
  `booking_id` int(11) DEFAULT NULL,
  `amount` decimal(10,2) DEFAULT NULL COMMENT 'SỐ TIỀN ĐÃ TRẢ TRONG MỘT LẦN THANH TOÁN (Tổng 700 nhưng có thể trả trước 500)\r\n',
  `payment_method` enum('cash','transfer','momo') DEFAULT NULL COMMENT 'phương thức thanh toán. tiền mặt, chuyển khoản banking, momo ',
  `payment_status` enum('unpaid','partial','paid') DEFAULT NULL COMMENT 'chưa thanh toán, thanh toán một phần, đã thanh toán hết',
  `payment_time` timestamp NOT NULL DEFAULT current_timestamp(),
  `note` varchar(255) DEFAULT NULL,
  `user_id` int(11) DEFAULT NULL COMMENT 'Ai là người thu tiền, branch_owner_id '
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci COMMENT='1 booking có N payments. Cũng có thể xem là tiền cọc trước';

--
-- Đang đổ dữ liệu cho bảng `payments`
--

INSERT INTO `payments` (`payment_id`, `booking_id`, `amount`, `payment_method`, `payment_status`, `payment_time`, `note`, `user_id`) VALUES
(4, 7, 300000.00, 'momo', 'partial', '2026-01-18 03:00:00', 'Khách đặt cọc trước', 15),
(5, 8, 150000.00, 'cash', 'paid', '2026-01-20 12:40:00', 'Thanh toán phần còn lại sau khi đá xong', 15),
(6, 8, 150000.00, 'cash', 'paid', '2026-01-20 12:40:00', 'Thanh toán phần còn lại sau khi đá xong', 15),
(7, 9, 1800000.00, 'cash', 'paid', '2026-01-31 18:44:46', 'Đã thanh toán hết', 20),
(8, 10, 360000.00, 'cash', 'paid', '2026-01-31 18:53:44', 'Đã thanh toán hết', 20),
(9, 11, 1800000.00, 'cash', 'paid', '2026-01-31 19:18:09', 'Đã thanh toán hết', 22),
(10, 12, 5220000.00, 'cash', 'paid', '2026-01-31 19:29:28', 'Đã thanh toán hết', 22),
(11, 13, 1500000.00, 'cash', 'paid', '2026-01-31 19:57:43', 'Đã thanh toán hết', 22),
(12, 14, 1800000.00, 'cash', 'paid', '2026-01-31 20:09:26', 'Chờ thanh toán', 22),
(13, 15, 1800000.00, 'cash', 'paid', '2026-01-31 20:11:51', 'Chờ thanh toán', 22),
(14, 16, 1800000.00, 'cash', 'paid', '2026-01-31 20:14:37', 'Chờ thanh toán', 22),
(15, 17, 1500000.00, 'cash', 'paid', '2026-01-31 20:21:29', 'Chờ thanh toán', 22),
(16, 18, 1500000.00, 'cash', 'paid', '2026-01-31 20:23:38', 'Chờ thanh toán', 22),
(17, 19, 1500000.00, 'cash', 'paid', '2026-01-31 20:27:35', 'Chờ thanh toán', 22),
(18, 20, 1800000.00, 'cash', 'paid', '2026-01-31 20:28:55', 'Chờ thanh toán', 22),
(19, 21, 1620000.00, 'cash', 'paid', '2026-01-31 20:29:34', 'Chờ thanh toán', 22),
(20, 22, 1500000.00, 'cash', 'paid', '2026-01-31 20:30:50', 'Chờ thanh toán', 22),
(21, 23, 1800000.00, 'cash', 'unpaid', '2026-01-31 20:46:01', 'Chờ thanh toán', 23),
(22, 24, 1800000.00, 'cash', 'unpaid', '2026-01-31 20:53:37', 'Chờ thanh toán', 23),
(23, 25, 2400000.00, 'cash', 'unpaid', '2026-02-01 11:43:16', 'Chờ thanh toán', 20),
(24, 26, 2500000.00, 'cash', 'unpaid', '2026-02-02 18:46:04', 'Chờ thanh toán', 20),
(25, 28, 2000000.00, 'cash', 'unpaid', '2026-02-03 14:11:30', 'Chờ thanh toán', 17),
(26, 29, 1629000.00, 'cash', 'unpaid', '2026-02-03 14:29:28', 'Chờ thanh toán', 20),
(27, 30, 1800000.00, 'cash', 'unpaid', '2026-02-03 14:34:55', 'Chờ thanh toán', 17),
(28, 31, 5600000.00, 'cash', 'unpaid', '2026-02-03 14:36:32', 'Chờ thanh toán', 17),
(29, 32, 1500000.00, 'cash', 'unpaid', '2026-02-03 14:37:02', 'Chờ thanh toán', 17),
(30, 33, 1500000.00, 'cash', 'unpaid', '2026-02-04 09:03:40', 'Chờ thanh toán', 24),
(31, 34, 1800000.00, 'cash', 'unpaid', '2026-02-07 13:52:56', 'Chờ thanh toán', 20),
(32, 35, 3000000.00, 'cash', 'unpaid', '2026-02-07 13:53:55', 'Chờ thanh toán', 20),
(33, 36, 1800000.00, 'cash', 'unpaid', '2026-02-07 13:54:24', 'Chờ thanh toán', 20),
(34, 37, 1800000.00, 'cash', 'unpaid', '2026-02-07 13:55:06', 'Chờ thanh toán', 20),
(35, 38, 1620000.00, 'cash', 'unpaid', '2026-02-24 14:32:52', 'Chờ thanh toán', 26),
(36, 39, 1020000.00, 'cash', 'unpaid', '2026-02-26 14:42:52', 'Chờ thanh toán', 20),
(37, 40, 2250000.00, 'cash', 'unpaid', '2026-02-26 14:52:09', 'Chờ thanh toán', 20),
(38, 41, 2250000.00, 'cash', 'unpaid', '2026-02-26 14:52:27', 'Chờ thanh toán', 20),
(39, 42, 2250000.00, 'cash', 'unpaid', '2026-02-26 14:53:02', 'Chờ thanh toán', 20),
(40, 43, 2700000.00, 'cash', 'unpaid', '2026-02-26 14:53:34', 'Chờ thanh toán', 20),
(41, 44, 2250000.00, 'cash', 'unpaid', '2026-02-26 14:54:30', 'Chờ thanh toán', 20),
(42, 45, 1800000.00, 'cash', 'unpaid', '2026-02-26 14:58:57', 'Chờ thanh toán', 20),
(43, 46, 1020000.00, 'cash', 'unpaid', '2026-02-28 16:16:24', 'Chờ thanh toán', 20),
(44, 47, 1500000.00, 'cash', 'unpaid', '2026-02-28 16:19:50', 'Chờ thanh toán', 20),
(45, 48, 5600000.00, 'cash', 'unpaid', '2026-03-04 16:17:25', 'Chờ thanh toán', 20),
(46, 49, 1500000.00, 'cash', 'unpaid', '2026-03-05 06:02:07', 'Chờ thanh toán', 27),
(47, 50, 5600000.00, 'cash', 'unpaid', '2026-03-10 17:27:37', 'Chờ thanh toán', 20);

-- --------------------------------------------------------

--
-- Cấu trúc bảng cho bảng `reviews`
--

CREATE TABLE `reviews` (
  `review_id` int(11) NOT NULL,
  `rating` tinyint(4) NOT NULL,
  `user_id` int(11) NOT NULL,
  `branch_id` int(11) NOT NULL,
  `comment` text DEFAULT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Đang đổ dữ liệu cho bảng `reviews`
--

INSERT INTO `reviews` (`review_id`, `rating`, `user_id`, `branch_id`, `comment`, `created_at`) VALUES
(1, 5, 20, 3, 'OK', '2026-01-31 07:28:21');

-- --------------------------------------------------------

--
-- Cấu trúc bảng cho bảng `services`
--

CREATE TABLE `services` (
  `service_id` int(11) NOT NULL,
  `service_name` varchar(100) DEFAULT NULL COMMENT 'tên dịch vụ',
  `service_type` enum('rent','sell') DEFAULT 'rent'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci COMMENT='danh sách các dịch vụ đi kèm khi thuê sân';

--
-- Đang đổ dữ liệu cho bảng `services`
--

INSERT INTO `services` (`service_id`, `service_name`, `service_type`) VALUES
(1, 'Giày', 'rent'),
(2, 'Găng tay', 'rent'),
(3, 'Quần áo', 'rent'),
(4, 'Áo', 'rent'),
(5, 'Nước suối', 'sell');

-- --------------------------------------------------------

--
-- Cấu trúc bảng cho bảng `users`
--

CREATE TABLE `users` (
  `user_id` int(11) NOT NULL,
  `username` varchar(50) NOT NULL,
  `password` varchar(255) NOT NULL,
  `full_name` varchar(100) DEFAULT NULL,
  `phone` varchar(20) DEFAULT NULL,
  `avata` varchar(255) DEFAULT NULL,
  `email` varchar(255) DEFAULT NULL,
  `role` enum('admin','staff','branch_owner','branch_staff','customer') NOT NULL DEFAULT 'customer' COMMENT 'admin, nhân viên, chủ chi nhánh, nhân viên chi nhánh, khách hàng',
  `status` tinyint(4) DEFAULT 1 COMMENT '1 là đang hoạt động, 0 là gì block',
  `created_at` datetime DEFAULT current_timestamp(),
  `branch_id` int(11) DEFAULT NULL COMMENT 'User này là chủ/nhân viên của chi nhánh nào. Nếu không có hoặc role != branch_owner => null'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Đang đổ dữ liệu cho bảng `users`
--

INSERT INTO `users` (`user_id`, `username`, `password`, `full_name`, `phone`, `avata`, `email`, `role`, `status`, `created_at`, `branch_id`) VALUES
(15, 'admin1', '$2b$10$ZLJd3EiPZ1pjINpmSFVILOXxo4R6MuguMDlVNL89vj6NgBQc5y8Zy', 'Lữ Văn Tính', '0818177533', '491510680_18002017331672055_5308144228321480053_n.jpg', 'tinhlu703@gmail.com', 'admin', 1, '2026-01-18 19:37:52', NULL),
(16, 'Tính Văn', '$2b$10$0kmys1ZlRkPp2rHHWGKy6.O3e1ERQoYzAiKX3B27Fvd1AeE69bkBW', 'Lữ Văn Tính', '0818177533', '491510680_18002017331672055_5308144228321480053_n.jpg', 'tinhlu703@gmail.com', 'customer', 1, '2026-01-18 20:15:18', NULL),
(17, 'tinh@gmail.com', '$2b$10$YmL9GOMpJRRKH/wU8Ipbwe92790N.0fG3cBoLtsZfTcaWYTv0aY6S', 'Lữ Văn Tính', '0818177533', '491510680_18002017331672055_5308144228321480053_n.jpg', 'tinhlu703@gmail.com', 'branch_owner', 1, '2026-01-19 10:50:23', 3),
(18, 'Hasekimagru', '$2b$10$0VOpSkDgZUI.EFMafg/DRODntwxtVg2DAw2UVJyqhDew6hUhOQsie', 'tinh van', '0818177533', '491510680_18002017331672055_5308144228321480053_n.jpg', 'tinhlu703@gmail.com', 'customer', 1, '2026-01-20 12:08:09', NULL),
(19, 'Admin', '$2b$10$BDppk9El5d5ejJb1D.RP3.IHaebU2MFs5fo3SOsFuP0OQ/UqSRjH2', 'tinh van', '0818177533', '491510680_18002017331672055_5308144228321480053_n.jpg', 'tinhlu703@gmail.com', 'customer', 1, '2026-01-20 15:02:06', NULL),
(20, 'tinhvan', '$2b$10$ZeK2WulmDmzvHYLndT9za.VxX2P8UAcU6Ph/TQ69nBVAO5jzW3lPK', 'Tính Văn ', '0813502953', '491510680_18002017331672055_5308144228321480053_n.jpg', 'tinhlu703@gmail.com', 'customer', 1, '2026-01-20 15:25:35', NULL),
(21, 'vantinh', '$2b$10$GPPR8TtQVDGCN/YtOXR5GOi0diZCY4YrIYakDozf54n/gZkiTngf2', 'tinh van', '0818177533', '491510680_18002017331672055_5308144228321480053_n.jpg', 'tinhlu703@gmail.com', 'customer', 1, '2026-01-21 11:21:26', NULL),
(22, 'tinhlu703@gmail.com', '$2b$10$Wx0kw3NrKUzxhg1Mpy4IieJqCnyffjVBdfQ2RE8ePhIPsos6iLO82', 'Lữ Văn Tính', '0818177533', '491510680_18002017331672055_5308144228321480053_n.jpg', 'tinhlu703@gmail.com', 'customer', 1, '2026-02-01 02:16:24', NULL),
(23, 'tinhvanlu', '$2b$10$X70e60AfY6mlBtFE3tqAQ.s5rVGrVeP1CejUQ5y5i8EE8YcT0QXum', 'tinhvanlu', '0818177533', '491510680_18002017331672055_5308144228321480053_n.jpg', 'tinhlu263@gmail.com', 'customer', 1, '2026-02-01 03:45:28', NULL),
(24, 'huygia', '$2b$10$t5gb0FIolLObFHXG37Q0K.0mpmDodrfaz3Bqpxus1oZH89Vbu2UGm', 'huy huy', '0818177533', '491510680_18002017331672055_5308144228321480053_n.jpg', 'huymoba27@gmail.com', 'customer', 1, '2026-02-04 16:02:16', NULL),
(26, 'huylu', '$2b$10$lSKD//e7vhBgwAN1ZttMl.6rwX1ZUN5.Iwib6m1wSYDEwmrn/iBLW', 'Nguyen', '0818177533', '491510680_18002017331672055_5308144228321480053_n.jpg', 'ttnguyen-cntt17@tdu.edu.vn', 'customer', 1, '2026-02-24 21:32:06', NULL),
(27, 'tinh', '$2b$10$AQ95fyiPQdIHRpbMajlR/ezPFPs9QsqBS8KzH5Tgf/1HGJwp7PHoq', 'Tính Văn', '08181177533', '491510680_18002017331672055_5308144228321480053_n.jpg', 'tathainguyen68@gmail.com', 'customer', 1, '2026-03-05 13:01:18', NULL);

--
-- Chỉ mục cho các bảng đã đổ
--

--
-- Chỉ mục cho bảng `bookings`
--
ALTER TABLE `bookings`
  ADD PRIMARY KEY (`booking_id`),
  ADD KEY `user_id` (`user_id`),
  ADD KEY `idx_booking_time` (`booking_date`,`start_time`,`end_time`),
  ADD KEY `FK_Booking_FieldFieldType` (`field_field_type_id`),
  ADD KEY `idx_revenueBookings` (`final_price`);

--
-- Chỉ mục cho bảng `booking_services`
--
ALTER TABLE `booking_services`
  ADD PRIMARY KEY (`booking_service_id`),
  ADD KEY `booking_id` (`booking_id`),
  ADD KEY `branch_service_id` (`branch_service_id`);

--
-- Chỉ mục cho bảng `branches`
--
ALTER TABLE `branches`
  ADD PRIMARY KEY (`branch_id`);

--
-- Chỉ mục cho bảng `branch_notifications`
--
ALTER TABLE `branch_notifications`
  ADD PRIMARY KEY (`branch_notification_id`),
  ADD KEY `branch_id` (`branch_id`),
  ADD KEY `booking_id` (`booking_id`),
  ADD KEY `idx_branch_created_at` (`branch_id`,`created_at`);

--
-- Chỉ mục cho bảng `branch_services`
--
ALTER TABLE `branch_services`
  ADD PRIMARY KEY (`branch_service_id`),
  ADD KEY `branch_id` (`branch_id`),
  ADD KEY `service_id` (`service_id`);

--
-- Chỉ mục cho bảng `favorites`
--
ALTER TABLE `favorites`
  ADD PRIMARY KEY (`favority_id`),
  ADD KEY `user_id` (`user_id`),
  ADD KEY `field_id` (`field_id`);

--
-- Chỉ mục cho bảng `fields`
--
ALTER TABLE `fields`
  ADD PRIMARY KEY (`field_id`),
  ADD KEY `idx_fields_branch` (`branch_id`);

--
-- Chỉ mục cho bảng `field_field_types`
--
ALTER TABLE `field_field_types`
  ADD PRIMARY KEY (`field_field_type_id`),
  ADD UNIQUE KEY `uk_field_type` (`field_id`,`field_type_id`),
  ADD KEY `field_type_id` (`field_type_id`),
  ADD KEY `idx_fft_field` (`field_id`);

--
-- Chỉ mục cho bảng `field_pricing_rules`
--
ALTER TABLE `field_pricing_rules`
  ADD PRIMARY KEY (`pricing_rule_id`),
  ADD KEY `idx_pricing_rule_lookup` (`field_field_type_id`,`day_of_week`,`start_time`,`end_time`,`status`);

--
-- Chỉ mục cho bảng `field_types`
--
ALTER TABLE `field_types`
  ADD PRIMARY KEY (`field_type_id`),
  ADD KEY `idx_typeName` (`type_name`);

--
-- Chỉ mục cho bảng `notifications`
--
ALTER TABLE `notifications`
  ADD PRIMARY KEY (`notification_id`),
  ADD KEY `user_id` (`user_id`);

--
-- Chỉ mục cho bảng `payments`
--
ALTER TABLE `payments`
  ADD PRIMARY KEY (`payment_id`),
  ADD KEY `booking_id` (`booking_id`),
  ADD KEY `user_id` (`user_id`);

--
-- Chỉ mục cho bảng `reviews`
--
ALTER TABLE `reviews`
  ADD PRIMARY KEY (`review_id`),
  ADD KEY `user_id` (`user_id`),
  ADD KEY `branch_id` (`branch_id`);

--
-- Chỉ mục cho bảng `services`
--
ALTER TABLE `services`
  ADD PRIMARY KEY (`service_id`);

--
-- Chỉ mục cho bảng `users`
--
ALTER TABLE `users`
  ADD PRIMARY KEY (`user_id`),
  ADD UNIQUE KEY `username` (`username`),
  ADD UNIQUE KEY `username_2` (`username`),
  ADD KEY `FK_User_Branch` (`branch_id`);

--
-- AUTO_INCREMENT cho các bảng đã đổ
--

--
-- AUTO_INCREMENT cho bảng `bookings`
--
ALTER TABLE `bookings`
  MODIFY `booking_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=51;

--
-- AUTO_INCREMENT cho bảng `booking_services`
--
ALTER TABLE `booking_services`
  MODIFY `booking_service_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=4;

--
-- AUTO_INCREMENT cho bảng `branches`
--
ALTER TABLE `branches`
  MODIFY `branch_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=7;

--
-- AUTO_INCREMENT cho bảng `branch_notifications`
--
ALTER TABLE `branch_notifications`
  MODIFY `branch_notification_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=23;

--
-- AUTO_INCREMENT cho bảng `branch_services`
--
ALTER TABLE `branch_services`
  MODIFY `branch_service_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=5;

--
-- AUTO_INCREMENT cho bảng `favorites`
--
ALTER TABLE `favorites`
  MODIFY `favority_id` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT cho bảng `fields`
--
ALTER TABLE `fields`
  MODIFY `field_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=9;

--
-- AUTO_INCREMENT cho bảng `field_field_types`
--
ALTER TABLE `field_field_types`
  MODIFY `field_field_type_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=15;

--
-- AUTO_INCREMENT cho bảng `field_pricing_rules`
--
ALTER TABLE `field_pricing_rules`
  MODIFY `pricing_rule_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=192;

--
-- AUTO_INCREMENT cho bảng `field_types`
--
ALTER TABLE `field_types`
  MODIFY `field_type_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=4;

--
-- AUTO_INCREMENT cho bảng `notifications`
--
ALTER TABLE `notifications`
  MODIFY `notification_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=42;

--
-- AUTO_INCREMENT cho bảng `payments`
--
ALTER TABLE `payments`
  MODIFY `payment_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=48;

--
-- AUTO_INCREMENT cho bảng `reviews`
--
ALTER TABLE `reviews`
  MODIFY `review_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT cho bảng `services`
--
ALTER TABLE `services`
  MODIFY `service_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=6;

--
-- AUTO_INCREMENT cho bảng `users`
--
ALTER TABLE `users`
  MODIFY `user_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=28;

--
-- Các ràng buộc cho các bảng đã đổ
--

--
-- Các ràng buộc cho bảng `bookings`
--
ALTER TABLE `bookings`
  ADD CONSTRAINT `FK_Booking_FieldFieldType` FOREIGN KEY (`field_field_type_id`) REFERENCES `field_field_types` (`field_field_type_id`);

--
-- Các ràng buộc cho bảng `booking_services`
--
ALTER TABLE `booking_services`
  ADD CONSTRAINT `booking_services_ibfk_1` FOREIGN KEY (`booking_id`) REFERENCES `bookings` (`booking_id`),
  ADD CONSTRAINT `booking_services_ibfk_2` FOREIGN KEY (`branch_service_id`) REFERENCES `branch_services` (`branch_service_id`);

--
-- Các ràng buộc cho bảng `branch_notifications`
--
ALTER TABLE `branch_notifications`
  ADD CONSTRAINT `branch_notifications_ibfk_1` FOREIGN KEY (`branch_id`) REFERENCES `branches` (`branch_id`),
  ADD CONSTRAINT `branch_notifications_ibfk_2` FOREIGN KEY (`booking_id`) REFERENCES `bookings` (`booking_id`);

--
-- Các ràng buộc cho bảng `branch_services`
--
ALTER TABLE `branch_services`
  ADD CONSTRAINT `branch_services_ibfk_1` FOREIGN KEY (`branch_id`) REFERENCES `branches` (`branch_id`),
  ADD CONSTRAINT `branch_services_ibfk_2` FOREIGN KEY (`service_id`) REFERENCES `services` (`service_id`);

--
-- Các ràng buộc cho bảng `favorites`
--
ALTER TABLE `favorites`
  ADD CONSTRAINT `favorites_ibfk_1` FOREIGN KEY (`user_id`) REFERENCES `users` (`user_id`),
  ADD CONSTRAINT `favorites_ibfk_2` FOREIGN KEY (`field_id`) REFERENCES `fields` (`field_id`);

--
-- Các ràng buộc cho bảng `fields`
--
ALTER TABLE `fields`
  ADD CONSTRAINT `fields_ibfk_2` FOREIGN KEY (`branch_id`) REFERENCES `branches` (`branch_id`);

--
-- Các ràng buộc cho bảng `field_field_types`
--
ALTER TABLE `field_field_types`
  ADD CONSTRAINT `field_field_types_ibfk_1` FOREIGN KEY (`field_id`) REFERENCES `fields` (`field_id`),
  ADD CONSTRAINT `field_field_types_ibfk_2` FOREIGN KEY (`field_type_id`) REFERENCES `field_types` (`field_type_id`);

--
-- Các ràng buộc cho bảng `field_pricing_rules`
--
ALTER TABLE `field_pricing_rules`
  ADD CONSTRAINT `field_pricing_rules_ibfk_1` FOREIGN KEY (`field_field_type_id`) REFERENCES `field_field_types` (`field_field_type_id`);

--
-- Các ràng buộc cho bảng `notifications`
--
ALTER TABLE `notifications`
  ADD CONSTRAINT `notifications_ibfk_1` FOREIGN KEY (`user_id`) REFERENCES `users` (`user_id`);

--
-- Các ràng buộc cho bảng `payments`
--
ALTER TABLE `payments`
  ADD CONSTRAINT `payments_ibfk_1` FOREIGN KEY (`booking_id`) REFERENCES `bookings` (`booking_id`),
  ADD CONSTRAINT `payments_ibfk_2` FOREIGN KEY (`user_id`) REFERENCES `users` (`user_id`);

--
-- Các ràng buộc cho bảng `reviews`
--
ALTER TABLE `reviews`
  ADD CONSTRAINT `reviews_ibfk_1` FOREIGN KEY (`user_id`) REFERENCES `users` (`user_id`),
  ADD CONSTRAINT `reviews_ibfk_2` FOREIGN KEY (`branch_id`) REFERENCES `branches` (`branch_id`);

--
-- Các ràng buộc cho bảng `users`
--
ALTER TABLE `users`
  ADD CONSTRAINT `FK_User_Branch` FOREIGN KEY (`branch_id`) REFERENCES `branches` (`branch_id`);
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
